{"podcast_details": {"podcast_title": "The Saudi Pro League Show", "episode_title": "Neymar!!!", "episode_image": "https://storage.buzzsprout.com/variants/ckva4uihd9e61tvv8rzciz4jjsa0/2a0b0dfa96ac0f52f5e0059e82dcd227fca7bcc798acc4833c7df068e886f95e.jpeg", "episode_transcript": " Hello my name is JJ Chaos and welcome to the Saudi Pro League show. We've got a big show in store for you today. We are going to be reviewing the results in week one of the 2023-2024 season of the Saudi Pro League and I must say that I had never watched a game of the Saudi Pro League until this week. And to say that I was impressed by the league is an absolute understatement. I was able to watch three games last week, so I currently live in Sydney, Australia, and the broadcaster that broadcasts the games into Australia has done a deal where they will broadcast three games a week. So I'll tell you what those three games were when I review week one's action. And impressive, absolutely impressive. This is the fastest growing football league in the world and it is fast becoming the number one destination league in the world because we have news of players that are being linked or have signed confirmed deals to join the Saudi Pro League. And let me just mention these names. Players that are linked to the Saudi Pro League but haven't signed any deals yet. Liverpool goalie Alison Becker, Andros Townsend's name's been linked to the Saudi Pro League, Amarik Laporte from Manchester City's been linked to the league, Lucas Dina has been linked to the league. Now the players that have confirmed signing, Mera Demiral has signed with Al Ali, Yassin Bono has signed with Al Halal, and the big news, ladies and gentlemen, this, I mean the Saudi Pro League is already on the map when it comes to world football. But if the world hasn't woken up and taken notice that the Saudi Pro League is here and the Saudi Pro League is here to stay as the fastest growing league and soon to be the number one football league in the world, then this just, for me, if I wasn't following this closely and if I pick up my phone or read on my iPad or pick up, we don't pick up newspapers anymore, but you get the point. If I read that Neymar has signed a two-year deal with Al Halal to join the Saudi Pro League, that would make me take notice. So welcome Neymar to the Saudi Pro League. I can't wait to watch you in action for Al Halal. I'll be able to tell all the listeners that listen to this show who Al Halal's next match is against. So this is the running sheet for the show today. As I said, we're going to review last week's action. We're going to go through all the results of all nine games. I'll tell you all the goal scorers. I'll tell you about the games I was able to watch on the broadcast here in Sydney, Australia. I'm going to give out my Performance of the Week award. So I will give out a, I'm not going to give out an award, but I will name who I believe the player was who put in the Performance of the Week. And we're going to calculate we're not going to calculate, but at the end of the year, I'm going to give my Performance of the Year award. So that'll be something for you to keep an eye on or an ear on as you listen to this podcast as we go through. I want to thank everybody so far that has listened to the show. Last week's episode gained more listeners than the trailer did. So judging by the upward trajectory of this podcast, I'm hoping this podcast grows at the same rate of growth that the actual Saudi Pro League does. We're going to preview this week's games. I'm going to tell you which games I'll be able to watch on the host broadcast. So let's get into it. Let's review the results from week one of the Saudi Pro League. And I just pull them up on my screen here. So first game, Friday night, Al Ali 3, defeated Al Hazem 1. Goals for Al Ali, a hat trick, for the day viewing Roberto Firmino. He scored goals in the 6th, 10th and 72nd minute. And for Al Hazem, their goal came from Vena in the 50th minute. So Al Ali 3, Al Hazem 1. Then on Saturday, there were two games. Al Taiee 1, Damak FC 0. For Al Taiee, their goal was scored by Harabi in the 79th minute. And also on Saturday, Al Fayha 3, defeated Al Khalij 1. And Al Fayha, their goals were scored by Rila in the 13th minute. Sakala in the 7th minute of stoppage time in the first half. And there was a penalty scored by Mandas in the 76th minute. For Al Khalij, their goal was scored by Dubais in the 87th minute. So Al Fayha 3, Al Khalij 1. Then on Sunday, two games. Al Fayha, FC 1, drew with Al Taewoon 1. For Al Fayha, their goals were scored by Al Burakhan in the 24th minute. And for Al Taewoon, their goal was scored by Girotta in the first minute of stoppage time in the first half. And in the second game on Sunday, Al Riyad 1, defeated Al Weather 0. And for Al Riyad, their goal was scored by Musonna in the 17th minute. Which takes us to Monday. There was four games being played on Monday. Abba 1, they hosted Al Halal. And Al Halal beat Abba 3-1. And for Abba, their goal scorer was Bigua in the 33rd minute. And for Al Halal, another hat trick, a second hat trick of the weekend. And again for a debuting player, Malcolm, former Barcelona and Zenit St Petersburg player. He scored goals in the 31st, 55th and 77th minutes. So a second hat trick of the weekend for Malcolm as Al Halal 3 defeated Abba 1. And then in the second game on Sunday, Al Raeed 0 went down to Al Hidihad 3. For Al Hidihad, Hamdallah scored in the 58th minute. And then Coronado scored in the 73rd and 79th minute. Final two games of last weekend, Al Shabab 1 drew with Al Akhdud 1. For Al Shabab, their goal was scored in the 66th minute by Jaber. And for Al Akhdud, their goal was scored by Berka in the 41st minute. And in the final game of the weekend, what I like to call the main event of the weekend, in somewhat of an upset I guess, Al Nasser, Cristiano Ronaldo's team, he didn't play on the weekend because he had played in the King's Cup some 48 hours earlier. But Al Edifac 2 defeated Al Nasser 1. Al Edifac scored goals by Kwaizon in the 47th minute and Moussa Dembele in the 53rd minute. Sadio Mane scored Al Nasser's goal. He scored in the fourth minute of the game. So Al Edifac coming from 1-0 down to defeat Al Nasser. Two goals to one. And that is the results of week one of the Saudi Pro League season for 2023-24. I'm not going to read out the table yet because we've had one game and there's nine winners and nine losers. Sorry, there were actually there was two draws. Was it two draws? Let me just look at my results again. Yep, there was two draws. So there was two draws, seven winners, seven losers. And that is the results for week one. And I'll tell you which games I was able to watch. So as I said, where I live here in Sydney, Australia, we get to watch three games broadcast on one of the streaming services, which is a subsidiary of one of the television networks here in Australia. I was able to watch the first game of the season, Al Ali and Al Hazem. And that's when I fell in love with the Saudi Pro League. The atmosphere looked amazing. It was a different type of crowd to what I'm used to in Europe. There's not that fervent one-eyed support. All the people in that stadium looked like they were happy to be there. And that's what you want. You want a bit of a carnival atmosphere. I liken it to when I went to watch a Women's World Cup game a few weeks ago here in Sydney when England took on Denmark. It was just a carnival atmosphere. I'd much prefer to go watch a game of sport where there's a carnival atmosphere rather than a home crowd. I mean, it's a carnival atmosphere. I mean, it's a carnival crowd just fervently one-eyed supporting their team, not believing that anything their team does is wrong and believing that everything the other team does is wrong. I don't like that kind of atmosphere. So that was the game I watched, which was the first game of the year. And then I was able to watch two of the Sunday games. So I was able to watch Al Idi had take on Al Aed and Nuno Espirito Santo. Started off his season with a clean sheet victory and Al Idi had scoring a 3-0 victory there in that game. And one of the things that caught my eye in that game for Al Idi had was not Karim Benzema, but Karim Benzema's strike partner. And his name is Abdur-Razak Hamdallah. And apparently he was the top goal scorer for the league last year, or the top scorer for Al Idi had anyway. So Al Idi had looked like a really strong team. They've got Benzema up front with Hamdallah. They've got N'Golo Kante and Fabinho in midfield. They look really strong and look like a really strong unit and they're going to be hard to beat. Coronado came in and scored two goals late in the second half when the game was pretty much over. But a really strong showing from Al Idi had as they started their campaign with a 3-0 victory against Al Raid. And then the final match of the weekend I was able to watch on TV. Jordan Henderson captaining Al Etifak up against Al Nasser and with Cristiano Ronaldo sitting out the game. It was good to see Sadio Mane walking out with the armband. So two ex-Liverpool players captaining opposing sides in the last game of the weekend. Stevie Gerrard was standing on the touchline as the manager of Al Etifak. And they looked lost in the first half. Don't know what he said. Don't know what Stevie Gerrard said to the team at half time. But they came out all guns blazing and two quick goals put Al Etifak in front. They were able to stay in front. There was 14 minutes of stoppage time in the second half of that match between Al Etifak and Al Nasser. But I'm not complaining because I get to see more football. So hopefully, you know, this might actually, all this extra stoppage time might actually, you know, lead to players not time wasting because the less time you waste during the 90 minutes, the less time gets added on at the end. There was a lot of players going down with injuries and cramp in that second half, which is why there was 14 minutes of stoppage time in that second half. But I was, as I said, right off the top of the show, I was thoroughly entertained with all three matches that I saw last week. And I can't wait for week two. And I'll be able to go through and I'll preview all nine games of the Saudi Pro League for week two. And I'll be able to tell you which are the three games that I'll be able to watch. So it's time now for me to give my performance of the week. This is my performance of the week. I'm going to read this out every week at the end of every weekend's games. And this week, my performance of the week is going to Roberto Firmino of Al Ali for his hat trick that he scored in the first game of the season against Al Hazem. All eyes were on the front three of Al Ali, Alain Saint-Maximin, Riyad Mahrez and Roberto Firmino. And he looked sharp, Roberto Firmino. He looked really, really sharp. He was not playing as much in the last season at Liverpool as he was in the years previous. Everyone remembers the front three of Liverpool of Sadio Mane, Roberto Firmino and Mohamed Salah. Well, two of those players are now in the Saudi Pro League and one of them may be joining them soon. I don't think Mohamed Salah looked very happy when he was substituted by Jurgen Klopp on the weekend against Chelsea in the Premier League. But a hat trick for Roberto Firmino in his first game at Al Ali. Obviously, it was a tough decision. It was either him or Malcolm that I give the award to and only by the fact that I watched Roberto Firmino's game that he gets the award this week. So it is going to be a bit of a slanted award in that respect is that I only get to watch three games of the Saudi Pro League every week. So if someone out there knows how I can watch all nine games every week of the Saudi Pro League, shoot me a message on Twitter. I'm on Twitter at real JJ chaos, R-E-A-L-J-J-C-H-A-O-S. And let me know if there's a way I can watch legally, if there's a way I can watch all nine games of the Saudi Pro League, let me know. I'd love to hear from you. But yeah, this week's performance of the week goes to Roberto Firmino from Al Ali. All right, it is now time to preview week two of the Saudi Pro League. Here we go. Thursday, Damarq FC take on Al Riyadh and Al Khalij take on Al Ali. Friday, Al-Aqdud host Al Fateh. Al-Hazim host Al-Etifak. Al-Nassar FC host Al-Tawun. And Al-Waida take on Al-Shabab. Those games are taking place on Friday. And then on Saturday, three games. Abba take on Al-Raid. Al-Halal host Al-Fahar. And Al-Etihad take on Al-Tayyee. Those are the nine games taking place this week in week two of the 2023-24 Saudi Pro League. And just before I leave you all, I will let you know which of the nine games I'll be able to watch. So I'll be able to watch Al-Nassar take on Al-Tawun. And hopefully that game is the return of Cristiano Ronaldo to action and also Brozovic as well. Al-Halal versus Al-Fahar is also on television here in Australia. So I'll be able to watch Al-Halal. I wonder if Neymar will be able to be registered in time for that match. I may be able to see Neymar. And then the last game I'll be able to watch in the weekend is Al-Etihad taking on Al-Tayyee. And those are the three games I will be able to watch. And those are the three games I will be able to watch this weekend. So all in all, my closing comments for the week before I let you go is if what I saw is the first week of the Saudi Pro League and all of the officials that are connected to the Saudi Pro League are all saying that we're not done yet when it comes to registering players, gaining support for the league. As I take a sip of coffee, the league is only going to get bigger and bigger and bigger. Do yourself a favour if you can. Watch some video from the first couple of seasons of the Premier League and then compare that to what we see on the television now. And the Formula One travels to Saudi Arabia each year. The WWE travels to Saudi Arabia at least once a year, sometimes twice. We now have the fastest growing football league in the world. And this podcast is hopefully the fastest growing football podcast in the world. And for those of you listening to this podcast, you have already seeked out the exploding football on Spotify or Apple or wherever you get your podcasts. So jump on board, ladies and gentlemen. Don't miss the bus. There's plenty of room for as many football fans around the world that want to partake in and watch this league. It's not one of these situations where fans of the Saudi Pro League don't want new bandwagon fans jumping on board too late to the party. No, no, no, no, no, no. There is room on this bus for everyone. And the one thing I was looking at was the standard of football. And I've got to say, playing football in 35 degree heat can't be easy. And taking that into consideration, actually even not taking that into consideration, the standard of football was amazing. The standard of football was really, really good from what I saw on television. And if Andros Townsend, Amarik Laporte, Lucas Dina and Alison Becker are all considering offers to join the Saudi Pro League, and just just think of this for a second. Five to 10 years ago, Neymar, Cristiano Ronaldo and Karim Benzema were all playing in El Clasico. They all now play in the Saudi Pro League. So what does that tell you? What does that tell you? I must be honest, ladies and gentlemen, I've been podcasting on and off now for about seven years. And I have never been more excited about a podcast than I am about recording this podcast every week. I get to watch the sport I love. I get to talk about the sport I love. And I get to be part of what I believe is something really, really special. So for those of you that live in Australia, jump on 10 play. That's how you can watch three games a week of the Saudi Pro League. As I said, if there's anyone out there in the Twitterverse or in podcast land that knows how I can listen to, sorry, knows how I can watch more games of the Saudi Pro League on an app or something like that, let me know on Twitter. At real JJ Chaos is my Twitter handle. You can get in contact with me. And please, if at all possible, jump on Apple, jump on Spotify, leave a five star rating, leave a review if you can. I'd really, really appreciate it. And if you like this show, you can also listen to my other show, which is called The Fake Pre-Game Show. It drops every Friday. That's a more of a variety sports show where I talk about interesting things in and around the world of sports in general. So not just football. I talk about other sports like professional wrestling and cricket, rugby union, those kinds of things as well. So that's all for today. It is currently, as I record this, we are less than an hour away from the Women's World Cup semi-final between Australia and England. As I was on my way home from work this afternoon, I have to pass through a train station and there was a lineup of people trying to transfer trains from one to the other to get out to the stadium out at Olympic Park here in Sydney. It was ridiculous. I believe the game is a sellout. So this show is called the Saudi Pro League Show, but we're here to celebrate the whole sport of football around the world. So come on England. Do England proud and win the World Cup semi-final against the Matildas. That's all for this week's show. Thank you very much for listening. I look forward to bringing you another edition of the Saudi Pro League Show next week. Until then, enjoy the football. Bye for now. The Saudi Pro League Show is produced by Chaos Global Productions."}, "podcast_summary": "Summary: \n\nIn this episode of the Saudi Pro League Show, host JJ Chaos reviews the results of week one of the 2023-2024 season. He expresses his impressed and excitement with the league, stating that it is the fastest growing football league in the world and is becoming the number one destination league. JJ mentions several players who are linked or have signed confirmed deals with the Saudi Pro League, including names like Neymar, Alisson Becker, Andros Townsend, and Améric Laporte. He also highlights the signings of players like Mera Demiral and Yassin Bono. \n\nJJ gives out his Performance of the Week award to Roberto Firmino of Al Ali for his hat-trick in the first game of the season. He previews the upcoming games for week two and mentions the games he will be able to watch on television. JJ emphasizes the high standard of football in the league and encourages listeners to jump on board and be a part of this growing league. He also asks for recommendations on how to watch more games and promotes his other show, The Fake Pre-Game Show. \n\nThe episode ends with JJ showing his excitement about podcasting about the Saudi Pro League and his appreciation for the listeners. He encourages them to leave ratings and reviews and says goodbye until the next episode.", "podcast_League": "The Saudi Pro League is the fastest growing football league in the world and is becoming one of the top destination leagues. It has garnered attention with players being linked or signing confirmed deals to join the league, including the likes of Neymar, Alison Becker, Andros Townsend, and Amarik Laporte. The league's impressive growth and recent signings have put it on the map in the world of football."}