{"podcast_details": {"podcast_title": "Seaman Says", "episode_title": "England are in a World Cup Final!", "episode_image": "https://megaphone.imgix.net/podcasts/091b432a-a739-11eb-8e67-b337eee56124/image/Seaman_Says_logo_for_platforms.jpg?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_transcript": " This episode is brought to you by PayCore, the HR and payroll software made for leaders. It's never been harder to recruit, hire, and engage workers. That's why HR leaders and frontline managers depend on PayCore for all things people management, from onboarding and performance reviews to compensation and benefits. Learn more at PayCore.com slash leaders. This episode is brought to you by Dave, a banking app that's leveling the financial playing field. Because when you download Dave, you could get up to $500 in five minutes or less. No credit check, no late fees. It's part of Dave's extra cash account. Advance the money you need with no interest and then settle up later. Download Dave today at Dave.com slash Spotify. For terms and conditions, go to Dave.com slash legal. Eligibility criteria and instant transfer fees apply. Banking services provided by Evolve member FDIC. This episode is brought to you by Shopify. No matter how big you want to grow, Shopify gives you everything you need to take your business to the next level. Shopify is the commerce platform that makes it easy to show up and sell exactly the way you want to. No need to code or design. Sign up for your $1 per month trial period today. Visit Shopify.com slash offer 23 to get started. Spending some time reconnecting with nature this summer? Here's a camping hack from LL Bean to make your next trip the best yet. Tired of your tent mates flashlights shining in your eyes and camp? Bring an empty half gallon milk jug or clear water bottle. Simply strap a headlamp around it and it becomes a soft white lantern for everyone to see the light. For more camping hacks, visit youtube.com slash LL Bean. Be an outsider. He's one of England's most capped international players. He's one of the world's most decorated goalkeepers. This is Seaman Says with David Seaman. Welcome back to Seaman Says, it's a huge weekend with the Women's World Cup final taking place on Sunday. And how good does it feel to be able to say that? I mean, I was talking to some kids David, I was watching this semi-final at Toka Social, which actually Harry Kane and Leah Williamson as England captains have both got a share in this at the O2. It's a really good football watching experience. And there were so many children there aged between nine and 11 and I was giggling because some of them were saying to me, in my life, I've never known. In your whole nine years, in your whole 11 years. But it is incredible because this generation coming through, I think the wider picture is that this young generation won't know anything but success when it comes to English football. You know, they've seen an England team reach a Euro final from the men's, the women win the Euros final at Wembley for home Euros. And now they're going to be able to say, oh, we've seen England women get to a World Cup final and I can't honestly, if Carlsberg, I shouldn't be promoting drinks, should I? But if Carlsberg did football right now, this is the era you want to be in. So before the tournament, Linda, you mentioned to us off camera that you didn't think England really had a chance. Now what do you think? Well, what you've got to do is stack up all of those injuries and have the spine of the squad. If you took the midfield, like Ellen White's out of it because she's retired. And then you look at Fran Kirby just behind her in that number 10 position, she's injured. Millie Bright coming into this, we didn't even know whether she would play. She'd been out since March and hadn't played for Chelsea. So it was touch and go whether she play. Leah Williamson as captain did her ACL. And then in the group stages, we had Kiera Walsh go down with her knee. And thankfully she came back to play so much football in these knockouts. But if you look at all of that and things adding up, then yeah, I was thinking we'll be lucky to get quarterfinals. And also the way that the draw was potentially going to open up. But what happened was big hitters were going out. Germany went out at the group stages. Olympic champions, Canada went out. You saw Brazil go home early. This kept happening. And as the draw was opening up, I was thinking, oh, I think I might have gone too early here in saying that England will go out around about the quarters. So then I was thinking semis, semis. And I thought that was our final against Australia. And you've got to take into account as well the home crowd. What a cauldron that would have been in terms of atmosphere. And intimidating as well for those players. They were used to doing it in front of a home crowd, but they haven't had that test yet. So I felt like that was the final for us. Yeah, I think they have impressed but also shocked a lot of people with the way that they've shown resilience, the way they've overcome hurdles. And a lot of that has to be credit to Serena Vigman. She's managed throughout all of this. She's managed to keep them calm. And it doesn't matter what's been thrown at them, they've manoeuvred it. The Lauren James incident. All of that, I think they've answered most of the questions. So with Lauren James, does she come back into the team for the final? I think Serena is going to stick with the same start in 11. I think Ella Toon will start. I think that team in that semifinal showed that they'd gone to a different level. I thought the way they managed that game tactically, but discipline as well was really important. And I think they'll need that against Spain. So Ella Toon in that role rather than Lauren James as a starter, I think, offers a lot defensively too. And we've got to expect that Spain are going to want to and probably will see a lot of the ball. They are very possession based. So it would probably suit the Lionesses to that team to stay the same. However, what I will say, the way that Spain have been using this impact substitute, a 19 year old to come and score goals crucially in the same way that Alessia Russo and Ella Toon were introduced in the Euros last year. I think Lauren James can do that here. She can come on as an impact sub and have a final say in this tournament. How amazing would that be for her, having started off so brightly, announced herself, everyone acknowledging that she was so skillful and really one of the promising world stars of the future. Then there was the tread incident. I'm not even going to call it a stamp, but we'll call it a tread. And you think, well, because the Lionesses won, she didn't get as much backlash, but how incredible if she could actually have the final word in a different way, in a way of maybe scoring the winner. It would be incredible. So I think Lauren James, she can't switch off completely because she's going to have to be focused. I think she will be called upon. How important do you think it is that it feels like Alessia Russo is now getting into the form that we needed her in at the start of the tournament? I speak to a lot of former strikers in terms of former Lionesses like Jodie Taylor and Natasha Dowie, who've been doing our daily World Cup podcast with us. So it's the offside role, World Cup daily with Sky Sports, if anyone wants to go and have a listen. We will be reacting to the whole tournament and we've been doing very much bite size analysis and daily episodes throughout. And they've all said that the mark of a true striker is that striker that can find just the inside netting is about placement rather than anything else. And I think that's what we've seen from Alessia Russo is that she is the finished product in terms of her finishing because of her accuracy with those shots. Now, she isn't always making the runs or those runs being found, but I think we've seen that Lauren Hemp can now develop that relationship with her in this senior England women's team going forward. That's really exciting. She's already got the Ella Toon and her that friendship off field Manchester United teammates. They already knew each other. But I think the rest of the Lionesses really now are getting used to Alessia Russo in that starting role. She is quick. I also like that she's alert to everything. Her hold up play is really important, I think, as well for England. It could prove to be that she is an outlet in this match. It might be more direct from the Lionesses in the final. So yeah, I think she's really come into her own. And Alessia Russo. I imagine that it's going to be her shirts, Callum, that are going to sell the most off the back of this World Cup. It doesn't matter. I mean, we've had some brilliant performances from others, but I don't know. There's just something about Alessia Russo and the younger generation in particular. They just love her. Right. Let's talk about the second biggest game of the weekend after the World Cup final, Man City against Newcastle. And it is. This is the billing. This is the one that everyone's going to be drawn to, I think, this weekend. If there was the Chelsea-Liverpool match that I was looking forward to last weekend, this is the one that you can't miss, isn't it? It's Saturday evening. And I feel like it's promising goals. I mean, anyone who's in the betting ranks would probably think there's going to be over two and a half in this. And I think at the Etihad, Man City, they didn't have as long a pre-season. And so they came in quite late. And I wonder if Newcastle can catch them a little bit, but if anything, they need to make sure that they show that they're the ones to catch. And I think it could be quite an open game. Who do you think is coming into this game, Lindsay, with more confidence? I think off the back of the 5-1 victory, I think Newcastle will come into this. But remember, Newcastle do perform better at home. This isn't a way trip. And I think going to the Etihad, they're facing the champions who did the treble. I think there'll be a little bit of mental shift as well and some respect that will be paid there. And that might play into Pep's hands a little bit. But I think they could cause an upset. My prediction is that I don't think they will. I think it will be close. But I think City will edge it by a goal. Yeah, I do, especially, like what you said about Newcastle's away form. They are miles better at home. But yeah, like you said, he's got goals all over it. It'll probably be 0-0 or 1-1. I know. But yeah, I definitely want to watch because it's just like, especially with Newcastle coming off the back of that 5-1 hammering of Villa. And then De Bruyne are not playing as well. Yeah, looking forward to it. Put it this way. Will it surprise either of you if Newcastle did win it, edge it by a goal? Just. I think it'll just surprise me because we know what Newcastle are capable of. But you just can't see City, you can't see their performance just getting better and better all the time. You can't see them having a bad day because they've just got so many good players to come in. And De Bruyne have been out. They've still got mega replacements coming in. Yeah, so would it be? Yeah, I think it'd just be a surprise, but I still can't see it. I think it would be a surprise. I think when you look at the firepower and also look at the defense, Haaland is going to be tough for them to mark out of this game. And he could preoccupy sometimes even when he's not as involved. I don't know for sure that I feel like Haaland is going to necessarily score again in this match. But what he does do is he distracts defenders and he provides that presence that means that other opportunities open up. And what we know from Man City is that they've got endless other opportunities. So play in all of those. Yeah, I think that City will edge it, but I do think Newcastle will score. Come on, let's have a prediction. Come on, come on. All right, you go first, Lyn. This is the game that I want to watch. I want to watch Man City 3, Newcastle 2. Whoa, I'm going to go Man City 2, Newcastle 0. The other big game at the weekend is Spurs against Man United. Spurs will be quite confident after their 2-2 draw at Brentford, but I don't know what mental state Man United will be in. Because coming off the back of that performance against Wolves, that confidence has got to be low. So I'm going to go for Spurs, but just interesting life without Harry Kane. Now that they're bedding into that Harry Kane, life without Harry Kane, you've got two goals. Yeah, but where do you think Spurs will end up? Because none of us have predicted that they'll finish in European spots. No, I don't think Tottenham will end up in the top four. I think a good season for them is Europe. But it's just hard to see them scoring goals. You look at Harry Kane last season, they didn't play that good. He still gets 30-odd goals. Take that out of their team, where are the goals coming from? I feel that they'll be top eight. I think they'll finish sixth or seventh. But I think their main competition now, and I don't know whether they'll like hearing this, but Spurs main competition this season in Newcastle and Brighton, those are the potentially villain. Yeah, because they've not really, there's still time obviously, but they've not replaced Harry Kane with a proven goal scorer or anything. But I still think they'll do well. I think they'll go on Saturday, I'm going to go for two-one win to Tottenham. See, it could go two-one the other way quite easily. Or we could have another stalemate. I think Spurs starting the season with a point going home against Man United, they could end up with another point. I think I'm going to go one-one. Yeah, that's a good shout out. Yeah. NFL Sunday Ticket is now on YouTube and YouTube TV, which means that it just got easier to be an NFL fan, even if you live far away. Like maybe you like the Bears, but you're hibernating in Panthers territory. But with NFL Sunday Ticket, your out-of-market team is never more than a short distance away, specifically the distance from you to your remote control. NFL Sunday Ticket, now on YouTube and YouTube TV. Go to youtube.com slash presale to get $50 off. Terms and embargoes apply. Offer ends 919, no refund. Subscription auto renews. This episode is brought to you by Paycore. Paycore empowers leaders to build winning teams. With Paycore, leaders can recruit, onboard and train employees, set goals, and drive performance. If you're a leader, everyone depends on you. Who do leaders depend on? Paycore. Learn more at paycore.com slash leaders. Between the kids being home and hosting, everything in our house gets used up in summer. With Instacart, I can save money by stocking up on all my favorite summer brands. I save time by getting everything delivered in as fast as an hour. And I save myself a sink full of dirty dishes by stocking up on paper plates for the annual summer cookout. Live more on summer essentials, spend more time enjoying summer, add summer to cart, download the app to get free delivery on your first three orders. Offer valid for a limited time, minimum $10 per order. Additional terms apply. This episode is brought to you by Dave, a banking app that's leveling the financial playing field. Because when you download Dave, you could get up to $500 in five minutes or less. No credit check, no late fees. It's part of Dave's extra cash account. Advance the money you need with no interest and then settle up later. Download Dave today at Dave.com slash Spotify. For terms and conditions, go to Dave.com slash legal eligibility criteria and instant transfer fees apply. Banking services provided by Evolve member FDIC. Listen to Seaman Says ad free. Join the Seaman Says squad. David, we did some soliciting. All. That's me again. What's in this way? How much did we get? I'm social media. We put a message out, a message on social media asking for any questions that anyone might have and I get to put them to you. Um, budding 23 has asked how many goals is Saka getting this year and could he be Arsenal's top scorer? Um, I hope he's not Arsenal's top scorer, but there's every chance that he could be. Um, you know, the quality of his goal on the weekend was amazing. How many goals I would say. How many goals? I think anything from 10, no, 10 to 15 is a great return from him. But if I'm honest, I hope he's not our top scorer because I want our striker to be top scorer. Do you think any of your strikers are capable of getting 20, 25 plus? No, not at the moment. No. Um, because you know, with Havertz and then Jesus, um, I think they'll, they'll share that out a little bit between them. Hopefully. Um, I don't think we've got like, um, you know, like an out and out goal scorer, you know what I mean? You know, plus Saka's on penalties, isn't he? So yeah, his, his talent, his total might go up a little bit through that. You know, it's always good when you're strikers on the penalties because, you know, as we've seen with Harry Kane, you know, I miss how many penalties does he score? Um, but yeah, I'd rather it be spread out a little bit more, but Saka's got off to an amazing start. So follow up question to that then from AJ Jesse 1990 who asks, do Arsenal need a new striker? Do Arsenal need a new striker? Um, I want to say, yeah. Just because of, you know, the, the, the situation with Jesus and his, and his injury, you know, I think it's two operations he's had now, you know, I know one was just clear up or whatever it was. I don't know whether it's the, whether it's a different me or not. Um, but that's a little bit of a worry, you know, and then with Havertz, he's not an out and out striker, if you know what I mean? He seems to get involved in the play. Um, so would it be a good sign in year? Will it do? I think they'll do, they'll do it. I don't think so because I think they're struggling at the moment with the FFP with the financial fair play. Um, so yeah, I would like them to obviously to get an out and out goal scorer, but I don't think it'll happen. Do you think there's many out there? No, because there's, you know, you've, you've, we've just let one go to Germany. How good would that have been? I would have took you all day long, no matter what, you know, but I think, I think that could have had more reaction than when Solkhan were left to come to Arsenal. Just slightly. Yeah. If you want to put your questions to David, they don't all have to be Arsenal. Follow us on social media at Siemens podcast. Maybe nothing about Southampton this year, because obviously not in Premier League, but everybody else's teams come at us. The other 91 teams in the English league. Yeah. Not biting. Siemens says predictions with Parinage. O-Ratings only. Please gamble responsibly. Visit gamblerware.org. Right then, Lindsay, onto predictions for the rest of the games. Oh my gosh. What did they do to me? I don't know either. I didn't keep across this. I think you'd be pleasantly surprised. Lindsay, I think you will be. Oh no. I don't count then. Giving me and Cal so much stick. I think you'll be quite happy. So yeah, Lindsay, we managed to get you two exact scores in the opening weekend. Well done. Well done. I'm relieved. Was that you or me, Cal? I think both of them were me. Oh, you know, don't worry about that. I'm pretty sure they're both me, Adam. We better get our meetup planned because I'll be wanting to hold on to my champagne if I start pulling ahead. No, no, you're not. I'm going to have to get my I'm going to be front of you. We seem and sloshed. Yeah. So we managed to, yeah, we got two exact scores, the Bournemouth and West Ham match and Everton and Fulham and then David correctly got the Chelsea and Liverpool game. Yeah. Amazing. That's good standard. Now they've set me on my way out the traps. Right then, let's go with Nottingham Forest against Sheff United. And I know I predicted Sheff United to win at the weekend. To be fair, they were good, but this one is really hard to call. And I'm going to go for a one-one draw. I'm going to go two-nil Forest. Forest at home, I don't think they're going to struggle as much as they did last season. These are the sorts of games they should be winning. So two-nil. Fulham against Brentford, which West London, they haven't got to travel far for this one. I was impressed by Brentford at the weekend without Tony with Wissler. And you've got to remember how many saves Leno made. It might be a Craven Cottage, but I don't know. I just think Brentford will edge this two-one. Okay. I'm going to go the other way. I'm going to go for Fulham to win two-one. Next up is Liverpool against Bournemouth. I can't see anything other than a big Liverpool win here. I'm going to go with Liverpool three Bournemouth nil. Very close to my prediction. I'm going Liverpool three Bournemouth one. I do think that Dominic Salanchi is going to score. I don't know what it is about Dominic Salanchi. I always think he's going to score for Bournemouth. Took his goal well at the weekend. Yeah. I think Liverpool three Bournemouth one. Wolves against Brighton, which is hard for me to not be biased as usual, but in front of our home crowd, the start that Gary O'Neill made, the fact that I think we will feel really hard done by from that Manchester United result, there might be a bit of anger in the performance. I think we are recognising now that Brighton are top opposition. We've got to play at a certain level. I'm hoping they bring that same game. I'm going to say Wolves to win by one goal to nil. I'm going on the performance that Wolves gave at Man United. I'm going for a much more comfortable win, Lindsay, for Wolves. I'm going to go two nil to Wolves. Blimey. Yeah. Come on, Wolves. Don't let us down. Don't give it after the Lord May's show. Put in a British performance. Having been at the Brighton-Luton game, the score was flattering. At one point, Luton were in it. They could have drawn it level at one point. I just think the word chinks have been able to get at Brighton. So I'm going to hang on to that. Where we go next? Villa against Everton. Everton, really bad start. Villa, obviously, big injury to one of their main players in Mings. But I'll still go for Villa. I think this is going to be a tough afternoon for Everton. I'm going to go three-one Villa. I'm going three nil Villa. I don't think Everton are scoring. I think that's going to be a big problem for them this season. So yeah, home win. West Ham against Chelsea. West Ham still doing their business. So they've had James Ward-Prowse, Adam. They certainly have good bit of business for them. So he might go straight into the sides. I think it's going to be a tough afternoon actually for West Ham. I'm going to go two-one Chelsea. Okay. I totally agree. I think it is going to be a tough afternoon and I'm going to go two-nil Chelsea. The last up is Palace against Arsenal. This used to be like a really tough game. Used to be. I know. But now we're a lot better at dealing with things like this. So I'm going to go for a three-one win for Arsenal. I was going to go four-nil and then I remembered, oh, it's Roy. By the way, how much was he up for a scrap at the weekend? That was so funny. He was winning. That was great. Roy doesn't tend to let four in, does he? I'm going to go three-nil Arsenal. I don't think Palace are scoring. Right that's it for this week. We'll be back after the weekend with all the reactions to those games and the World Cup final. Don't forget, send us your messages on social media. We're at Seaman Podcast. See you all soon. Come on England. Come on Lionesses. This is a Listening Dog media production."}, "podcast_summary": "In this podcast summary, the hosts discuss the highlights of the Women's World Cup and the upcoming final. They talk about how the current young generation will only know success in English football and how injuries affected the England team's chances in the tournament. They also praise Serena Vigman, the coach, for managing the team's resilience. The hosts debate whether Lauren James should start or come on as an impact substitute in the final. They discuss Alessia Russo's performance and her potential as a top scorer. The hosts also share their predictions for upcoming Premier League matches, including Nottingham Forest vs Sheffield United, Fulham vs Brentford, Liverpool vs Bournemouth, Wolves vs Brighton, Aston Villa vs Everton, West Ham vs Chelsea, and Crystal Palace vs Arsenal.", "podcast_League": "e consistently performed and exceeded expectations. Despite the numerous injuries and doubts surrounding the team, England has defied the odds and made it all the way to the World Cup final. This success is a testament to their resilience, determination, and the exceptional leadership of coach Serena Vigman. The current generation of English football fans, particularly the younger ones, are witnessing a golden era where success seems to be the norm. With previous achievements such as reaching the Euro final and winning the Women's Euros at Wembley, this World Cup final appearance further solidifies England's place among the top teams in the world. It is indeed an exciting time to be a fan of English football."}