{"podcast_details": {"podcast_title": "Planet Sport Football Africa", "episode_title": "18 Aug -  Africans in Saudi Pro League - FIFA Womens World Cup Final - Kane to Bayern", "episode_image": "https://d3wo5wojvuv7l.cloudfront.net/t_rss_itunes_square_1400/images.spreaker.com/original/c439263429083c480e93e3d979f07c6d.jpg", "episode_transcript": " Hello there and welcome along to Planet Sport Football Africa, a passion for sport production where we look at African football, what's happening around the continent and what African players are doing overseas. I'm Steve Vickers in Harare, Zimbabwe, joined on the show by Ida Waringa and by Stuart Weir. And on this week's show we take a look at the Africans playing in the Saudi Pro League as the Big Money League continues to attract interest with Ida highlighting stars from the continent to have played there over the years. We have more on the FIFA Women's World Cup, the final on this Sunday and with the English Premier League back Stuart assesses the opening weekend. We also talk about Harry Kane's move to Bayern Munich. So with the FIFA Women's World Cup ending this Sunday the football will just keep on coming besides the European Leagues now up and running. On the continent we have the CAF Champions League and the Confederation Cup kicking off this weekend with preliminary round ties. The CAF Women's Champions League qualifiers are underway too with regional qualifiers around the continent and Mali's A.S. Mandé were the first to book their ticket to the Women's Champions League finals in Ivory Coast in November. They won the Wafoo Zone A qualifiers played in Liberia. Well we've been talking about the Saudi Pro League lots over the past few weeks on the show and the stories just keep on coming from there. One of this week's biggest football stories is Brazil forward Neymar joining Saudi Pro League side Al Hilal from the French champions Paris Saint-Germain. The deal for the former Barcelona player is understood to be worth about 98 million dollars plus add-ons and Neymar who joined Paris Saint-Germain for a world record fee of 220 million dollars in 2017 was not part of coach Louis Enrique's plans for the new season. He'll be paid an incredible 164 million dollars a year in Saudi Arabia and that's six times the amount he earned at a PSG. Well there have been some big African signings too of course in the Saudi Pro League but before we get to that there's already been a strong and notable African presence over the years in the Saudi League Aida. Right Steve I mean for Cristiano to join Al Nasser for example it meant that Cameroon's Vincent Aboubacar had to leave the club to make space and he is definitely one of the last Afghans most prolific definitely most standout players you know so there has been that African presence and actually quite a bit of it in the Saudi League. You see the Saudi League Steve started in 1975 as a competition but it only turned pro in 2008 that's 15 years but in those 15 years close to 400 African footballers representing 40 countries in the continent have played in the league that's substantial. It has been the go-to for footballers who perhaps failed to get away into Europe and you know you do get the sense that it just really needed a bigger than life Cristiano sort of figure you know to completely turn things around and that's actually what Neymar said you know on his move that look everyone thought that Cristiano was crazy to do it but look at how many players now that he's managed to pull over to that side since I mean we're talking Ballon d'Or winners we're talking World Cup winners African winners they're all there. The league if you ask me definitely got a bit of a spotlight after Audion Igalu moved there as well I mean nothing on the current level of course but I do believe that many also got to know about it then because the Nigerian came from Man United you know so that was quite a notable move if you remember lots of eyes were on him and he recently extended his stay there so he is going to be in the Saudi League for at least another two years and when he got there he found fellow Nigerian Ahmed Musa in Saudi then you know he did two years at Al Nasser as well and Steve this might be arguable but it is safe to say that these are players in the latter parts of their careers so in that way as we have said before you know the Saudi League still you know hasn't really been able to shed that tag off where players go to play their last days or you know for the more cynical people where careers go to die you know I mean you look at Moroccan international Abderazak Hamdallah for example yes he was part of the record-setting World Cup team but you would think that he'd be a more crucial cog in the national team considering how prolific he is in the Saudi League I mean he has finished as top scorer several times in its entire history the league has had 14 times that Africans have been top scorers but it all started with Senegalese striker Musa Ndow before Hamdallah before Igalo it was Ndow in 1994 he became the first African to win the proverbial golden boot if you will and some of the more high-profile African players over the years have been the late Christian Atsu another Ghanaian Suley Montary Egypt's four-time afghan winning goalkeeper Esam El Hadari Mohamed Barakat who is a former BBC African footballer of the year and Ghanaian legend Pascal Fendounault Steve last season had 41 Africans representing 18 different countries in the Saudi League looking at this season the only thing missing will be an African coach yes it became quite close to having one actually because of Pizzo Mossimani the South African who coached the South African national team also Mamaloudi Sundowns to the Champions League title and Al Ahly of Egypt as well he was coaching second tier side Al Ahly Jeddah and guided them to promotion but quit in June claiming he and his technical staff hadn't been paid since the start of the year and Pizzo went on to join Abu Dhabi side Al Wadah along with his technical team so maybe that will happen in the coming years an African coach in the Saudi Pro League but just take us through the main African signings ahead of the new season Ida well how about we start with Senegal's top three players August started really well for Al Nasser they got Sadio Mane you know and who would ever have thought Steve that we'd see Mane and Cristiano on the same team it shows you you know goes to show just how much football has changed Al Nasser got Mane for 30 million dollars from Bayern Munich he had had quite the underwhelming season there and he did fall out of favor in the end after that sunny incident Kallidou Koulibaly well this was back in June and he signed to Al Hilal for 21 million dollars from Chelsea and Chelsea pretty much decided to cut on their losses Steve it had also been an underwhelming season for Koulibaly and he went to the Middle East on a three-year deal three days after Koulibaly signing for Al Hilal well it must have served as some form of inspiration motivation I'm sure that these guys were also talking and Edward Mendy signed for Al Ali you know the Senegalese national goalkeeper he signed for Al Ali also for 21 million dollars also on a three-year deal so looking at other players outside of the Senegalese national team Riyad Mahrez he spent five years with Pep Guardiola at Manchester City and he signed for Al Ali they got him for 39 million dollars and he also got signed for a three-year contract in the Saudi league separately Steve talks did stall for Hakeem Ziyech to join Al Nasser as he pivoted to Galatasaray where he has had medicals and as of the last one month Cristiano Ronaldo's club Al Nasser well they were banned from registering any new players by FIFA until they settle a debt with Leicester City now Al Nasser can still sign new players as we're seeing but they can't register them to play until outstanding debts are paid off by the club. Well fascinating insights there thanks very much Ida next here on Planet Sport Football Africa brought to you by Passion for Sport to the FIFA Women's World Cup ending this Sunday with England playing Spain in what should be a very exciting and all European final. The African interest ended in the round of 16 with South Africa Nigeria and Morocco all getting into the knockout stage at Africa's best ever Women's World Cup but unable to go any further. So it's been a fantastic tournament I really have been enjoying it so England Spain in the final England having knocked out the co-host Australia in the semi-finals Spain beating Sweden in a dramatic game 2-1 with all the goals coming in the last 10 minutes. Well England will have their star player Lauren James are back for the game after a two-match suspension and on our website we've got a new blog there it's called Being Human and Making Mistakes and Receiving Forgiveness. Here's Planet Sport Football Africa's Ephraim Tagu. Yes Steve we all have different ways of learning in life but as human beings who are inevitably imperfect we generally learn by making mistakes we do something wrong endure the consequences and hopefully learn from the experience so we do better next time. When England women's star striker Lauren James deliberately stepped on the back of her Nigerian opponent Michelle Allozi in the round of 16 clash she committed a foul that would see her receive a red card and a two-match ban in the tournament. It was a moment of madness from a player who has been one of England's standout performers in the competition and arguably the squad's most talented footballer. A manager Sarina Wichman said she apologized and felt really bad she would never want to hurt someone she's the sweetest person I know. An England team statement added that she was full of remorse and that it was wholly out of character. There was grace from her opponent Allozi who posted on social media we are playing on the world stage this game is one of passion insurmountable emotions and moments all respect for Lauren James. James herself said to Allozi all my love and respect to you I am sorry for what happened also for our England fans and my teammates playing with and for you is my greatest honor and I promise to learn from my experience. We are flawed people and we will mess up sometimes. While the players rush of blood to the head could have cost her team their chance to win the tournament England pulled through to the final but it's an episode in a major tournament she's unlikely to forget in a hurry. England scraped through the Nigeria tie in the end on penalties and have made it through to Sunday's final with James on the sidelines serving her ban. The Bible describes getting things wrong and falling short of God's standards as sin. We are flawed people and we will mess up sometimes. The good news is that we can receive grace, mercy and forgiveness from God himself because of the sacrifice Jesus made on the cross taking the sin of the world upon his shoulders and breaking its power over us. As John's first letter in the New Testament states if we claim to be without sin we deceive ourselves and the truth is not in us. If we confess our sins he's faithful and just and will forgive us our sins and purify us from all unrighteousness. Lauren James has had some forgiveness from those around her maybe her moment of redemption on the pitch is yet to come in Sunday's final. Well that's Ephraim Tagu there you can read that blog on our website it's called Being Human, Making Mistakes and Receiving Forgiveness that's on our website planetsport.tv and then you click on the blog section. Well this is Planet Sport Football Africa brought to you by Passion for Sport still to come Stuart on the opening weekend of the English Premier League. You can follow us on Twitter or X I should say now at a Planet Sport FA you can download our app and listen to the show anytime and access past programs in our archive. To download the app go to the play store or the Apple iTunes app store and enter Planet Sport Football Africa. Well lots on the English Premier League coming up but just briefly let's go to social media. Last week we asked are you in favor of more stoppage time so this season in the Premier League there's what's being referred to as World Cup stoppage time where referees are giving additional time matching the delays in the game as in the World Cup in Qatar and at the ongoing Women's World Cup. So this is giving maybe around as much as 10 minutes at the end of the game and even more on some occasions and some players have said it'll make the season even more exhausting for them. So we asked are you in favor and almost everybody said yes. Well in Sierra Leone Momodou Kalfala says it's a good move. In Liberia Trends K Calvin Walter says I think it's very good for our players because that extra time at the end of the match will give players time to regain their energy and to become more creative says Walter. We heard from Congo Republic and a Kams Simba Eli says even if clubs get a lot of additional time it won't make a difference although having said that Arsenal won the Community Shield two weeks ago on penalties after they equalized against Manchester City in the 101st minute of the game and Belong Paji in the Gambia also thinks it won't make much difference saying opportunities lost during the 90 minutes of the game cannot be fully recovered with even 15 minutes or so of additional time but at least it will give hope to the teams says Belong. So thanks very much for all of those comments so from a fan's point of view looks as though we are happy with the longer stoppage time because it's a more playing time for us to enjoy. Thanks to everybody who got in touch. Let's go to our European football expert Stuart Weir now here on Planet Sport Football Africa. So an eventful match day one in the English Premier League Stuart. It's back Steve. The first weekend is behind us and in some ways it was quite predictable because Manchester City and Arsenal the top two both won but both suffered significant bad luck you might say. Arsenal having already lost Gabriel Jesus saw their new signing Urien Timber suffer a serious knee injury on his debut and could be out for months and similarly Kevin De Bruyne is injured now and could be out for several months they say. Manchester United beat Wolves they had a lot of possession but it was up to 75th minute before they managed a shot on target. United were also fortunate not to concede a penalty when their new Cameroonian goalkeeper Ounana came for a cross, seemed to miss it and took out the Wolves striker and the reaction was extraordinary because the referees association apologised to Wolves afterwards for the poor decision. United were without their new 90 million dollar striker Rasmus Hoyland who got injured in pre-season with his previous club Atalanta in Italy. I said last week the big game in paper would be Chelsea Liverpool and it ended 1-1 a frenetic first half showing the Premier League at its best and worst. Liverpool scored two early goals only for VAR to rule out the second then Chelsea put the ball in the net twice in two minutes and again the second one ruled out for offside. I think the outcome probably satisfied neither teams and Chelsea under Mauricio Pochettino's first league game had six players making their first appearance for the club. Now the bottom of the table already has an ominous look for the three promoted clubs Luton, Sheffield United and Burnley all losing. Luton fans held up a banner saying the greatest fairy tale in football history but not all fairy tales have a happy ending. The Sheffield United players who celebrated promotion at the end of the season well only six of them were in the starting lineup. It's hard fact really Steve but players who get a club promoted into the Premier League are often deemed not to be good enough to keep them there. And we've got to mention James Millner who played for Brighton 21 years after his league debut for Leeds United and over those 21 years he's played 600 Premier League games for Leeds Newcastle Aston Villa Manchester City and Liverpool are a remarkable achievement. Then the three relegated clubs have had mixed starts in the championship Leicester City winning both their games Leeds picking up just one point and Southampton have had a win and a draw and Southampton drew 4-4 with Norwich Steve eight goals scored that means there would have been six minutes of added time for goal celebrations and in fact on that subject Bournemouth West Ham was the shortest game with seven minutes 44 seconds extra and Newcastle Aston Villa incredibly 17 minutes 39 seconds extra played. The average length of games at the end of last season was just under eight minutes extra see how much it has grown and interestingly in the first weekend of this season five players got yellow cards for time wasting go back a year and there were none and we've had two games delayed for extraordinary reasons at one the electronic ticket system wouldn't work and he couldn't let anyone in and at Brentford would you believe it the water supply to the toilets malfunctioned and the game couldn't start until you got a plumber you couldn't make it up and congratulations to David Moyes who becoming the third manager to manage a Premier League club in at least 20 different seasons following Alex Ferguson and Arsene Wenger and so this weekend there again will be games spread over four days including Tottenham at home to Manchester United and Manchester City at home to Newcastle on Saturday but only nine games as Luton's home game with Burnley has been postponed as Luton's Kenilworth Road ground is not ready for the Premier League as yet. Yes a lot of renovations needed there and Stuart a big African presence on the opening weekend of the Premier League. Yes Steve if I have counted correctly there were 51 African players in Premier League squads this season and 33 of them were involved in the first weekend. There were big money signings making their first appearance like Andre O'Nanagh who kept that clean sheet for Manchester United or Nicholas Jackson who almost scored for Chelsea against Liverpool. The three promoted clubs have added to the numbers with them having eight Africans in their teams last weekend. Nottingham Forest had five. We've been used to them having a strong African presence with Ola Aina, Serge Oury, Willy Bolley, Checo Kuwate, and Tayo Awani and it was Awani who scored their first goal in the Premier League this season. Simon Adringa from Cote d'Ivoire marked his debut with Brighton coming on to substitute and scoring and Brentford's two goals were scored by players we're familiar with, Cameroon's Brian Buemo and Congolese Joanne Wissah. Moussala thought he had scored on the first day of the season as he has done for the previous six years but VAR decided that his left ear or some other obscure body part was marginally offside. Really marginal call, a bit unlucky on him. And finally Steve, I need to tell you about one Luton town player who had a crazy day. He's Nigerian, his name is Fred Onyedinam. He's on loan at Rotherham United from Luton and in two second half minutes he scored, celebrated his goal too long and was shown a yellow card, then he waved an imaginary card at the referee and was himself shown a second yellow card all within two minutes. Another indication I think of how many yellow cards we're going to see this season. Yeah Nigeria's Fred Onyendima, he's with Rotherham on loan from Luton, an eventful game indeed for him. Okay let's talk about Harry Kane now and his move from Spurs to Bayern Munich finally happened a week ago. Kane deciding to take up the offer and to pursue winning trophies having won none with Spurs. Here's his farewell on social media to the fans. Sad to be leaving a club I've spent nearly 20 years of my life at from an 11-year-old boy. To a 30-year-old man now there's been so many great moments and special memories. I've had so many great moments. I felt like this was the time to leave me and my family, we'll cherish it forever, we'll never forget all the moments we've had together. So thank you, I'll be watching this season. Good luck to Tottenham, good luck to the whole club. So yeah it's not a goodbye because you never know how things pan out in the future but it's a thank you and I'll see you soon. So that's Harry Kane's goodbye on social media to the Tottenham fans. A good move Stuart? Harry Kane in the end decided to leave Tottenham. He'd made clear he was not going to sign another contract. He said all the right things, he thanked the club and spoke about his ambition to win trophies including the Champions League, feeling that that was something he couldn't do at Tottenham. There'll be great sadness at his departure but I think most Spurs fans will accept that Harry Kane has given their club great service over 14 years. He's a one club player apart from when he went on loan to get some experience early in his career. He scored 213 league goals in over 300 games for Tottenham and 280 goals in all games. Yes well I'm just wondering whether Kane should have stayed in England to pursue that all-time top scoring record. Asking on social media for your thoughts, did Harry Kane make the right decision? So he took the offer to pursue winning trophies with Bayern Munich, was unlikely to win any with Spurs in the next season or two but he has sacrificed the chance to become the English Premier League's all-time top scorer. 213 Premier League goals and needing 48 more to break Alan Shearer's record of 260. So what would you have done? Would you have gone for trophies if you were Harry Kane or maybe tried to achieve greatness by breaking a goal scoring record that was surely last for many years? You can post a comment on our Facebook page that's Planet Sport Football Africa or send us a what's up to plus 44 79 55232780. That's plus 44 79 55232780. Did Harry Kane make the right decision? Will he be remembered for winning trophies at Bayern Munich? Would he have been remembered more for breaking the all-time goal scoring record in the English Premier League? Right Stuart, besides Harry Kane, plenty of other transfer news to talk about. Well the big transfer news of the week is Brighton's Moises Caicedo, 21 year old Ecuadorian who has signed for Chelsea for something in the region of 150 million dollars. Which seems an awful lot of money to me for a player who's 21 and only had one full season in the Premier League. He signed an eight-year contract but that's all about Chelsea being able to spread the transfer fee over eight years for text purposes. And Chelsea seem also on the brink of signing Romeo Lavia, a 19 year old Belgian from Southampton, for about 70 million dollars. And interestingly both players were wanted by Liverpool but chose to go to Chelsea instead. Incredibly since the new owners took over Chelsea in June 2022, 23 new players have come in and 24 have left. Yes, clever financial accounting at Chelsea to help them to navigate the financial fair play rules. And Stuart, I mentioned Neymar's move to Saudi Arabia at the start of the programme. What does this do for his career would you say? Neymar, without doubt one of the most talented players of his generation, but he never quite made the impact at PSG that might have been expected. But as I've said before, the PSG team always looked a bit unbalanced with Messi, Neymar and Mbappe up front but much less talent behind them. And speaking of Mbappe, we understand that the player and PSG have kissed and made up and that he will play out the last year of his contract in France before leaving on a free transfer at the end of the season, probably to Real Madrid. I reported last week that Robert Sanchez, the Brighton goalkeeper, had signed for Chelsea and I said that it wouldn't surprise me if he became the number one. Well it happened quite quickly because when Real Madrid's Courtois suffered a serious injury they signed Kepa, the previous Chelsea goalkeeper. And incidentally David De Gea, who chose to leave Manchester United at the end of his contract, was linked with Real Madrid but he's still without a club. As well as Lavia, Southampton have lost James Ward-Prus, who's gone to West Ham, reinforcing the point we've often made about how hard it is for relegated clubs to get back into the Premier League when they lose their best players. Last week it was announced that West Ham and Manchester United had agreed terms for the transfer of Harry Maguire, but come Monday there was Harry Maguire on the Manchester United bench and his manager saying that he wanted Maguire to stay. Not sure what's happening there. And another transfer which intrigued me was Arsenal signing David Rea, the Brentford goalkeeper, on loan. I mean I have so many questions. Do they see him displacing Aaron Ramsdale as number one goalkeeper? If not, why would Rea sign for Arsenal to sit on the bench? And why would Brentford allow him to leave on loan rather than getting a transfer fee? Yes, intriguing. I'm sure that Rea will be fighting for that first choice goalkeepers jersey at Arsenal. Thanks a lot Stuart. That's it for the show for this week. So from me Steve Vickers in Zimbabwe, from Ida Waringa and from Stuart Weir. Thanks a lot for listening. Enjoy the football this weekend and a Planet Sport Football Africa is a passion for sport production."}, "podcast_summary": "Summary: \n\nIn this week's episode of Planet Sport Football Africa, the focus was on the African players in the Saudi Pro League, the FIFA Women's World Cup, and the opening weekend of the English Premier League. The hosts discussed the significant African presence in the Saudi Pro League over the years, highlighting players like Sadio Mane, Riyad Mahrez, and Odion Ighalo who have made moves to the league. They also mentioned the African players participating in the CAF Champions League and the CAF Women's Champions League qualifiers. \n\nThe podcast also included updates on the final of the FIFA Women's World Cup, with England set to face Spain, and insights on the opening weekend of the English Premier League. They discussed the injuries to key players like Kevin De Bruyne and Gabriel Jesus, as well as the mixed results of the promoted clubs. The show concluded with discussions on Harry Kane's move from Tottenham to Bayern Munich, as well as other transfer news, including Chelsea's signing of Moises Caicedo and the potential departure of Kylian Mbappe from PSG.\n\nOverall, the episode provided a comprehensive update on African footballers in various leagues and competitions, as well as the latest transfer developments in the world of football.", "podcast_League": "The Saudi Pro League, also known as the Saudi Professional League, is a professional football league in Saudi Arabia. It was established in 1975 as a competition but only turned professional in 2008. Since then, it has become an attractive destination for African footballers who may have struggled to secure opportunities in European leagues. Over the past 15 years, approximately 400 African footballers from 40 different countries have played in the league. This influx of talented African players, including Ballon d'Or winners and World Cup winners, has significantly raised the league's profile. Some notable African players who have played in the Saudi Pro League include Vincent Aboubacar, Ahmed Musa, and Odion Ighalo. While the league may still be associated with players in the latter stages of their careers, it continues to attract top African talent, and players like Abderazak Hamdallah have achieved great success, finishing as the league's top scorer multiple times. The Saudi Pro League has undoubtedly benefitted from the presence of renowned players like Cristiano Ronaldo and Neymar, who have chosen to join Saudi clubs. Nigerian forward Odion Ighalo's move from Manchester United to the Saudi Pro League also brought attention to the league. With its growing African presence and high-profile signings, the Saudi Pro League is steadily gaining more recognition in the football world."}